GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k50.inc
// Register: VREFCON2
#define VREFCON2 VREFCON2
VREFCON2                                 equ 0F7Bh
// bitfield definitions
VREFCON2_DACR_POSN                       equ 0000h
VREFCON2_DACR_POSITION                   equ 0000h
VREFCON2_DACR_SIZE                       equ 0005h
VREFCON2_DACR_LENGTH                     equ 0005h
VREFCON2_DACR_MASK                       equ 001Fh
VREFCON2_DACR0_POSN                      equ 0000h
VREFCON2_DACR0_POSITION                  equ 0000h
VREFCON2_DACR0_SIZE                      equ 0001h
VREFCON2_DACR0_LENGTH                    equ 0001h
VREFCON2_DACR0_MASK                      equ 0001h
VREFCON2_DACR1_POSN                      equ 0001h
VREFCON2_DACR1_POSITION                  equ 0001h
VREFCON2_DACR1_SIZE                      equ 0001h
VREFCON2_DACR1_LENGTH                    equ 0001h
VREFCON2_DACR1_MASK                      equ 0002h
VREFCON2_DACR2_POSN                      equ 0002h
VREFCON2_DACR2_POSITION                  equ 0002h
VREFCON2_DACR2_SIZE                      equ 0001h
VREFCON2_DACR2_LENGTH                    equ 0001h
VREFCON2_DACR2_MASK                      equ 0004h
VREFCON2_DACR3_POSN                      equ 0003h
VREFCON2_DACR3_POSITION                  equ 0003h
VREFCON2_DACR3_SIZE                      equ 0001h
VREFCON2_DACR3_LENGTH                    equ 0001h
VREFCON2_DACR3_MASK                      equ 0008h
VREFCON2_DACR4_POSN                      equ 0004h
VREFCON2_DACR4_POSITION                  equ 0004h
VREFCON2_DACR4_SIZE                      equ 0001h
VREFCON2_DACR4_LENGTH                    equ 0001h
VREFCON2_DACR4_MASK                      equ 0010h

// Register: VREFCON1
#define VREFCON1 VREFCON1
VREFCON1                                 equ 0F7Ch
// bitfield definitions
VREFCON1_DACNSS_POSN                     equ 0000h
VREFCON1_DACNSS_POSITION                 equ 0000h
VREFCON1_DACNSS_SIZE                     equ 0001h
VREFCON1_DACNSS_LENGTH                   equ 0001h
VREFCON1_DACNSS_MASK                     equ 0001h
VREFCON1_DACPSS_POSN                     equ 0002h
VREFCON1_DACPSS_POSITION                 equ 0002h
VREFCON1_DACPSS_SIZE                     equ 0002h
VREFCON1_DACPSS_LENGTH                   equ 0002h
VREFCON1_DACPSS_MASK                     equ 000Ch
VREFCON1_DACOE_POSN                      equ 0005h
VREFCON1_DACOE_POSITION                  equ 0005h
VREFCON1_DACOE_SIZE                      equ 0001h
VREFCON1_DACOE_LENGTH                    equ 0001h
VREFCON1_DACOE_MASK                      equ 0020h
VREFCON1_DACLPS_POSN                     equ 0006h
VREFCON1_DACLPS_POSITION                 equ 0006h
VREFCON1_DACLPS_SIZE                     equ 0001h
VREFCON1_DACLPS_LENGTH                   equ 0001h
VREFCON1_DACLPS_MASK                     equ 0040h
VREFCON1_DACEN_POSN                      equ 0007h
VREFCON1_DACEN_POSITION                  equ 0007h
VREFCON1_DACEN_SIZE                      equ 0001h
VREFCON1_DACEN_LENGTH                    equ 0001h
VREFCON1_DACEN_MASK                      equ 0080h
VREFCON1_DACPSS0_POSN                    equ 0002h
VREFCON1_DACPSS0_POSITION                equ 0002h
VREFCON1_DACPSS0_SIZE                    equ 0001h
VREFCON1_DACPSS0_LENGTH                  equ 0001h
VREFCON1_DACPSS0_MASK                    equ 0004h
VREFCON1_DACPSS1_POSN                    equ 0003h
VREFCON1_DACPSS1_POSITION                equ 0003h
VREFCON1_DACPSS1_SIZE                    equ 0001h
VREFCON1_DACPSS1_LENGTH                  equ 0001h
VREFCON1_DACPSS1_MASK                    equ 0008h

// Register: VREFCON0
#define VREFCON0 VREFCON0
VREFCON0                                 equ 0F7Dh
// bitfield definitions
VREFCON0_TSRNG_POSN                      equ 0002h
VREFCON0_TSRNG_POSITION                  equ 0002h
VREFCON0_TSRNG_SIZE                      equ 0001h
VREFCON0_TSRNG_LENGTH                    equ 0001h
VREFCON0_TSRNG_MASK                      equ 0004h
VREFCON0_TSEN_POSN                       equ 0003h
VREFCON0_TSEN_POSITION                   equ 0003h
VREFCON0_TSEN_SIZE                       equ 0001h
VREFCON0_TSEN_LENGTH                     equ 0001h
VREFCON0_TSEN_MASK                       equ 0008h
VREFCON0_FVRS_POSN                       equ 0004h
VREFCON0_FVRS_POSITION                   equ 0004h
VREFCON0_FVRS_SIZE                       equ 0002h
VREFCON0_FVRS_LENGTH                     equ 0002h
VREFCON0_FVRS_MASK                       equ 0030h
VREFCON0_FVRST_POSN                      equ 0006h
VREFCON0_FVRST_POSITION                  equ 0006h
VREFCON0_FVRST_SIZE                      equ 0001h
VREFCON0_FVRST_LENGTH                    equ 0001h
VREFCON0_FVRST_MASK                      equ 0040h
VREFCON0_FVREN_POSN                      equ 0007h
VREFCON0_FVREN_POSITION                  equ 0007h
VREFCON0_FVREN_SIZE                      equ 0001h
VREFCON0_FVREN_LENGTH                    equ 0001h
VREFCON0_FVREN_MASK                      equ 0080h
VREFCON0_FVRS0_POSN                      equ 0004h
VREFCON0_FVRS0_POSITION                  equ 0004h
VREFCON0_FVRS0_SIZE                      equ 0001h
VREFCON0_FVRS0_LENGTH                    equ 0001h
VREFCON0_FVRS0_MASK                      equ 0010h
VREFCON0_FVRS1_POSN                      equ 0005h
VREFCON0_FVRS1_POSITION                  equ 0005h
VREFCON0_FVRS1_SIZE                      equ 0001h
VREFCON0_FVRS1_LENGTH                    equ 0001h
VREFCON0_FVRS1_MASK                      equ 0020h

// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0F7Eh
// bitfield definitions
PMD0_TMR1MD_POSN                         equ 0000h
PMD0_TMR1MD_POSITION                     equ 0000h
PMD0_TMR1MD_SIZE                         equ 0001h
PMD0_TMR1MD_LENGTH                       equ 0001h
PMD0_TMR1MD_MASK                         equ 0001h
PMD0_TMR2MD_POSN                         equ 0001h
PMD0_TMR2MD_POSITION                     equ 0001h
PMD0_TMR2MD_SIZE                         equ 0001h
PMD0_TMR2MD_LENGTH                       equ 0001h
PMD0_TMR2MD_MASK                         equ 0002h
PMD0_TMR3MD_POSN                         equ 0002h
PMD0_TMR3MD_POSITION                     equ 0002h
PMD0_TMR3MD_SIZE                         equ 0001h
PMD0_TMR3MD_LENGTH                       equ 0001h
PMD0_TMR3MD_MASK                         equ 0004h
PMD0_ACTMD_POSN                          equ 0004h
PMD0_ACTMD_POSITION                      equ 0004h
PMD0_ACTMD_SIZE                          equ 0001h
PMD0_ACTMD_LENGTH                        equ 0001h
PMD0_ACTMD_MASK                          equ 0010h
PMD0_USBMD_POSN                          equ 0005h
PMD0_USBMD_POSITION                      equ 0005h
PMD0_USBMD_SIZE                          equ 0001h
PMD0_USBMD_LENGTH                        equ 0001h
PMD0_USBMD_MASK                          equ 0020h
PMD0_UARTMD_POSN                         equ 0006h
PMD0_UARTMD_POSITION                     equ 0006h
PMD0_UARTMD_SIZE                         equ 0001h
PMD0_UARTMD_LENGTH                       equ 0001h
PMD0_UARTMD_MASK                         equ 0040h
PMD0_STMD_POSN                           equ 0004h
PMD0_STMD_POSITION                       equ 0004h
PMD0_STMD_SIZE                           equ 0001h
PMD0_STMD_LENGTH                         equ 0001h
PMD0_STMD_MASK                           equ 0010h
PMD0_UART1MD_POSN                        equ 0006h
PMD0_UART1MD_POSITION                    equ 0006h
PMD0_UART1MD_SIZE                        equ 0001h
PMD0_UART1MD_LENGTH                      equ 0001h
PMD0_UART1MD_MASK                        equ 0040h
PMD0_SPI1MD_POSN                         equ 0001h
PMD0_SPI1MD_POSITION                     equ 0001h
PMD0_SPI1MD_SIZE                         equ 0001h
PMD0_SPI1MD_LENGTH                       equ 0001h
PMD0_SPI1MD_MASK                         equ 0002h
PMD0_SPI2MD_POSN                         equ 0002h
PMD0_SPI2MD_POSITION                     equ 0002h
PMD0_SPI2MD_SIZE                         equ 0001h
PMD0_SPI2MD_LENGTH                       equ 0001h
PMD0_SPI2MD_MASK                         equ 0004h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0F7Fh
// bitfield definitions
PMD1_CCP1MD_POSN                         equ 0000h
PMD1_CCP1MD_POSITION                     equ 0000h
PMD1_CCP1MD_SIZE                         equ 0001h
PMD1_CCP1MD_LENGTH                       equ 0001h
PMD1_CCP1MD_MASK                         equ 0001h
PMD1_CCP2MD_POSN                         equ 0001h
PMD1_CCP2MD_POSITION                     equ 0001h
PMD1_CCP2MD_SIZE                         equ 0001h
PMD1_CCP2MD_LENGTH                       equ 0001h
PMD1_CCP2MD_MASK                         equ 0002h
PMD1_ADCMD_POSN                          equ 0002h
PMD1_ADCMD_POSITION                      equ 0002h
PMD1_ADCMD_SIZE                          equ 0001h
PMD1_ADCMD_LENGTH                        equ 0001h
PMD1_ADCMD_MASK                          equ 0004h
PMD1_CMP1MD_POSN                         equ 0003h
PMD1_CMP1MD_POSITION                     equ 0003h
PMD1_CMP1MD_SIZE                         equ 0001h
PMD1_CMP1MD_LENGTH                       equ 0001h
PMD1_CMP1MD_MASK                         equ 0008h
PMD1_CMP2MD_POSN                         equ 0004h
PMD1_CMP2MD_POSITION                     equ 0004h
PMD1_CMP2MD_SIZE                         equ 0001h
PMD1_CMP2MD_LENGTH                       equ 0001h
PMD1_CMP2MD_MASK                         equ 0010h
PMD1_CTMUMD_POSN                         equ 0005h
PMD1_CTMUMD_POSITION                     equ 0005h
PMD1_CTMUMD_SIZE                         equ 0001h
PMD1_CTMUMD_LENGTH                       equ 0001h
PMD1_CTMUMD_MASK                         equ 0020h
PMD1_MSSPMD_POSN                         equ 0006h
PMD1_MSSPMD_POSITION                     equ 0006h
PMD1_MSSPMD_SIZE                         equ 0001h
PMD1_MSSPMD_LENGTH                       equ 0001h
PMD1_MSSPMD_MASK                         equ 0040h
PMD1_SSP1MD_POSN                         equ 0006h
PMD1_SSP1MD_POSITION                     equ 0006h
PMD1_SSP1MD_SIZE                         equ 0001h
PMD1_SSP1MD_LENGTH                       equ 0001h
PMD1_SSP1MD_MASK                         equ 0040h
PMD1_MSSP1MD_POSN                        equ 0006h
PMD1_MSSP1MD_POSITION                    equ 0006h
PMD1_MSSP1MD_SIZE                        equ 0001h
PMD1_MSSP1MD_LENGTH                      equ 0001h
PMD1_MSSP1MD_MASK                        equ 0040h
PMD1_EMBMD_POSN                          equ 0000h
PMD1_EMBMD_POSITION                      equ 0000h
PMD1_EMBMD_SIZE                          equ 0001h
PMD1_EMBMD_LENGTH                        equ 0001h
PMD1_EMBMD_MASK                          equ 0001h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 0F80h
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_RA6_POSN                           equ 0006h
PORTA_RA6_POSITION                       equ 0006h
PORTA_RA6_SIZE                           equ 0001h
PORTA_RA6_LENGTH                         equ 0001h
PORTA_RA6_MASK                           equ 0040h
PORTA_RA7_POSN                           equ 0007h
PORTA_RA7_POSITION                       equ 0007h
PORTA_RA7_SIZE                           equ 0001h
PORTA_RA7_LENGTH                         equ 0001h
PORTA_RA7_MASK                           equ 0080h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_AN3_POSN                           equ 0003h
PORTA_AN3_POSITION                       equ 0003h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0008h
PORTA_T0CKI_POSN                         equ 0004h
PORTA_T0CKI_POSITION                     equ 0004h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0010h
PORTA_AN4_POSN                           equ 0005h
PORTA_AN4_POSITION                       equ 0005h
PORTA_AN4_SIZE                           equ 0001h
PORTA_AN4_LENGTH                         equ 0001h
PORTA_AN4_MASK                           equ 0020h
PORTA_OSC2_POSN                          equ 0006h
PORTA_OSC2_POSITION                      equ 0006h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0040h
PORTA_VREFM_POSN                         equ 0002h
PORTA_VREFM_POSITION                     equ 0002h
PORTA_VREFM_SIZE                         equ 0001h
PORTA_VREFM_LENGTH                       equ 0001h
PORTA_VREFM_MASK                         equ 0004h
PORTA_VREFP_POSN                         equ 0003h
PORTA_VREFP_POSITION                     equ 0003h
PORTA_VREFP_SIZE                         equ 0001h
PORTA_VREFP_LENGTH                       equ 0001h
PORTA_VREFP_MASK                         equ 0008h
PORTA_LVDIN_POSN                         equ 0005h
PORTA_LVDIN_POSITION                     equ 0005h
PORTA_LVDIN_SIZE                         equ 0001h
PORTA_LVDIN_LENGTH                       equ 0001h
PORTA_LVDIN_MASK                         equ 0020h
PORTA_HLVDIN_POSN                        equ 0005h
PORTA_HLVDIN_POSITION                    equ 0005h
PORTA_HLVDIN_SIZE                        equ 0001h
PORTA_HLVDIN_LENGTH                      equ 0001h
PORTA_HLVDIN_MASK                        equ 0020h
PORTA_ULPWUIN_POSN                       equ 0000h
PORTA_ULPWUIN_POSITION                   equ 0000h
PORTA_ULPWUIN_SIZE                       equ 0001h
PORTA_ULPWUIN_LENGTH                     equ 0001h
PORTA_ULPWUIN_MASK                       equ 0001h
PORTA_RJPU_POSN                          equ 0007h
PORTA_RJPU_POSITION                      equ 0007h
PORTA_RJPU_SIZE                          equ 0001h
PORTA_RJPU_LENGTH                        equ 0001h
PORTA_RJPU_MASK                          equ 0080h

// Register: PORTB
#define PORTB PORTB
PORTB                                    equ 0F81h
// bitfield definitions
PORTB_RB0_POSN                           equ 0000h
PORTB_RB0_POSITION                       equ 0000h
PORTB_RB0_SIZE                           equ 0001h
PORTB_RB0_LENGTH                         equ 0001h
PORTB_RB0_MASK                           equ 0001h
PORTB_RB1_POSN                           equ 0001h
PORTB_RB1_POSITION                       equ 0001h
PORTB_RB1_SIZE                           equ 0001h
PORTB_RB1_LENGTH                         equ 0001h
PORTB_RB1_MASK                           equ 0002h
PORTB_RB2_POSN                           equ 0002h
PORTB_RB2_POSITION                       equ 0002h
PORTB_RB2_SIZE                           equ 0001h
PORTB_RB2_LENGTH                         equ 0001h
PORTB_RB2_MASK                           equ 0004h
PORTB_RB3_POSN                           equ 0003h
PORTB_RB3_POSITION                       equ 0003h
PORTB_RB3_SIZE                           equ 0001h
PORTB_RB3_LENGTH                         equ 0001h
PORTB_RB3_MASK                           equ 0008h
PORTB_RB4_POSN                           equ 0004h
PORTB_RB4_POSITION                       equ 0004h
PORTB_RB4_SIZE                           equ 0001h
PORTB_RB4_LENGTH                         equ 0001h
PORTB_RB4_MASK                           equ 0010h
PORTB_RB5_POSN                           equ 0005h
PORTB_RB5_POSITION                       equ 0005h
PORTB_RB5_SIZE                           equ 0001h
PORTB_RB5_LENGTH                         equ 0001h
PORTB_RB5_MASK                           equ 0020h
PORTB_RB6_POSN                           equ 0006h
PORTB_RB6_POSITION                       equ 0006h
PORTB_RB6_SIZE                           equ 0001h
PORTB_RB6_LENGTH                         equ 0001h
PORTB_RB6_MASK                           equ 0040h
PORTB_RB7_POSN                           equ 0007h
PORTB_RB7_POSITION                       equ 0007h
PORTB_RB7_SIZE                           equ 0001h
PORTB_RB7_LENGTH                         equ 0001h
PORTB_RB7_MASK                           equ 0080h
PORTB_INT0_POSN                          equ 0000h
PORTB_INT0_POSITION                      equ 0000h
PORTB_INT0_SIZE                          equ 0001h
PORTB_INT0_LENGTH                        equ 0001h
PORTB_INT0_MASK                          equ 0001h
PORTB_INT1_POSN                          equ 0001h
PORTB_INT1_POSITION                      equ 0001h
PORTB_INT1_SIZE                          equ 0001h
PORTB_INT1_LENGTH                        equ 0001h
PORTB_INT1_MASK                          equ 0002h
PORTB_INT2_POSN                          equ 0002h
PORTB_INT2_POSITION                      equ 0002h
PORTB_INT2_SIZE                          equ 0001h
PORTB_INT2_LENGTH                        equ 0001h
PORTB_INT2_MASK                          equ 0004h
PORTB_PGM_POSN                           equ 0005h
PORTB_PGM_POSITION                       equ 0005h
PORTB_PGM_SIZE                           equ 0001h
PORTB_PGM_LENGTH                         equ 0001h
PORTB_PGM_MASK                           equ 0020h
PORTB_PGC_POSN                           equ 0006h
PORTB_PGC_POSITION                       equ 0006h
PORTB_PGC_SIZE                           equ 0001h
PORTB_PGC_LENGTH                         equ 0001h
PORTB_PGC_MASK                           equ 0040h
PORTB_PGD_POSN                           equ 0007h
PORTB_PGD_POSITION                       equ 0007h
PORTB_PGD_SIZE                           equ 0001h
PORTB_PGD_LENGTH                         equ 0001h
PORTB_PGD_MASK                           equ 0080h
PORTB_CCP2_PA2_POSN                      equ 0003h
PORTB_CCP2_PA2_POSITION                  equ 0003h
PORTB_CCP2_PA2_SIZE                      equ 0001h
PORTB_CCP2_PA2_LENGTH                    equ 0001h
PORTB_CCP2_PA2_MASK                      equ 0008h

