GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k50.inc
// Register: TMR3H
#define TMR3H TMR3H
TMR3H                                    equ 0FB3h
// bitfield definitions
TMR3H_TMR3H_POSN                         equ 0000h
TMR3H_TMR3H_POSITION                     equ 0000h
TMR3H_TMR3H_SIZE                         equ 0008h
TMR3H_TMR3H_LENGTH                       equ 0008h
TMR3H_TMR3H_MASK                         equ 00FFh

// Register: T3GCON
#define T3GCON T3GCON
T3GCON                                   equ 0FB4h
// bitfield definitions
T3GCON_T3GGO_NOT_T3DONE_POSN             equ 0003h
T3GCON_T3GGO_NOT_T3DONE_POSITION         equ 0003h
T3GCON_T3GGO_NOT_T3DONE_SIZE             equ 0001h
T3GCON_T3GGO_NOT_T3DONE_LENGTH           equ 0001h
T3GCON_T3GGO_NOT_T3DONE_MASK             equ 0008h
T3GCON_T3GSS_POSN                        equ 0000h
T3GCON_T3GSS_POSITION                    equ 0000h
T3GCON_T3GSS_SIZE                        equ 0002h
T3GCON_T3GSS_LENGTH                      equ 0002h
T3GCON_T3GSS_MASK                        equ 0003h
T3GCON_T3GVAL_POSN                       equ 0002h
T3GCON_T3GVAL_POSITION                   equ 0002h
T3GCON_T3GVAL_SIZE                       equ 0001h
T3GCON_T3GVAL_LENGTH                     equ 0001h
T3GCON_T3GVAL_MASK                       equ 0004h
T3GCON_T3GGO_nT3DONE_POSN                equ 0003h
T3GCON_T3GGO_nT3DONE_POSITION            equ 0003h
T3GCON_T3GGO_nT3DONE_SIZE                equ 0001h
T3GCON_T3GGO_nT3DONE_LENGTH              equ 0001h
T3GCON_T3GGO_nT3DONE_MASK                equ 0008h
T3GCON_T3GSPM_POSN                       equ 0004h
T3GCON_T3GSPM_POSITION                   equ 0004h
T3GCON_T3GSPM_SIZE                       equ 0001h
T3GCON_T3GSPM_LENGTH                     equ 0001h
T3GCON_T3GSPM_MASK                       equ 0010h
T3GCON_T3GTM_POSN                        equ 0005h
T3GCON_T3GTM_POSITION                    equ 0005h
T3GCON_T3GTM_SIZE                        equ 0001h
T3GCON_T3GTM_LENGTH                      equ 0001h
T3GCON_T3GTM_MASK                        equ 0020h
T3GCON_T3GPOL_POSN                       equ 0006h
T3GCON_T3GPOL_POSITION                   equ 0006h
T3GCON_T3GPOL_SIZE                       equ 0001h
T3GCON_T3GPOL_LENGTH                     equ 0001h
T3GCON_T3GPOL_MASK                       equ 0040h
T3GCON_TMR3GE_POSN                       equ 0007h
T3GCON_TMR3GE_POSITION                   equ 0007h
T3GCON_TMR3GE_SIZE                       equ 0001h
T3GCON_TMR3GE_LENGTH                     equ 0001h
T3GCON_TMR3GE_MASK                       equ 0080h
T3GCON_T3GSS0_POSN                       equ 0000h
T3GCON_T3GSS0_POSITION                   equ 0000h
T3GCON_T3GSS0_SIZE                       equ 0001h
T3GCON_T3GSS0_LENGTH                     equ 0001h
T3GCON_T3GSS0_MASK                       equ 0001h
T3GCON_T3GSS1_POSN                       equ 0001h
T3GCON_T3GSS1_POSITION                   equ 0001h
T3GCON_T3GSS1_SIZE                       equ 0001h
T3GCON_T3GSS1_LENGTH                     equ 0001h
T3GCON_T3GSS1_MASK                       equ 0002h
T3GCON_T3GGO_POSN                        equ 0003h
T3GCON_T3GGO_POSITION                    equ 0003h
T3GCON_T3GGO_SIZE                        equ 0001h
T3GCON_T3GGO_LENGTH                      equ 0001h
T3GCON_T3GGO_MASK                        equ 0008h
T3GCON_NOT_T3DONE_POSN                   equ 0003h
T3GCON_NOT_T3DONE_POSITION               equ 0003h
T3GCON_NOT_T3DONE_SIZE                   equ 0001h
T3GCON_NOT_T3DONE_LENGTH                 equ 0001h
T3GCON_NOT_T3DONE_MASK                   equ 0008h
T3GCON_nT3DONE_POSN                      equ 0003h
T3GCON_nT3DONE_POSITION                  equ 0003h
T3GCON_nT3DONE_SIZE                      equ 0001h
T3GCON_nT3DONE_LENGTH                    equ 0001h
T3GCON_nT3DONE_MASK                      equ 0008h
T3GCON_T3DONE_POSN                       equ 0003h
T3GCON_T3DONE_POSITION                   equ 0003h
T3GCON_T3DONE_SIZE                       equ 0001h
T3GCON_T3DONE_LENGTH                     equ 0001h
T3GCON_T3DONE_MASK                       equ 0008h
T3GCON_T3GGO_NOT_DONE_POSN               equ 0003h
T3GCON_T3GGO_NOT_DONE_POSITION           equ 0003h
T3GCON_T3GGO_NOT_DONE_SIZE               equ 0001h
T3GCON_T3GGO_NOT_DONE_LENGTH             equ 0001h
T3GCON_T3GGO_NOT_DONE_MASK               equ 0008h
T3GCON_T3GGO_nDONE_POSN                  equ 0003h
T3GCON_T3GGO_nDONE_POSITION              equ 0003h
T3GCON_T3GGO_nDONE_SIZE                  equ 0001h
T3GCON_T3GGO_nDONE_LENGTH                equ 0001h
T3GCON_T3GGO_nDONE_MASK                  equ 0008h

// Register: ACTCON
#define ACTCON ACTCON
ACTCON                                   equ 0FB5h
// bitfield definitions
ACTCON_ACTORS_POSN                       equ 0001h
ACTCON_ACTORS_POSITION                   equ 0001h
ACTCON_ACTORS_SIZE                       equ 0001h
ACTCON_ACTORS_LENGTH                     equ 0001h
ACTCON_ACTORS_MASK                       equ 0002h
ACTCON_ACTLOCK_POSN                      equ 0003h
ACTCON_ACTLOCK_POSITION                  equ 0003h
ACTCON_ACTLOCK_SIZE                      equ 0001h
ACTCON_ACTLOCK_LENGTH                    equ 0001h
ACTCON_ACTLOCK_MASK                      equ 0008h
ACTCON_ACTSRC_POSN                       equ 0004h
ACTCON_ACTSRC_POSITION                   equ 0004h
ACTCON_ACTSRC_SIZE                       equ 0001h
ACTCON_ACTSRC_LENGTH                     equ 0001h
ACTCON_ACTSRC_MASK                       equ 0010h
ACTCON_ACTUD_POSN                        equ 0006h
ACTCON_ACTUD_POSITION                    equ 0006h
ACTCON_ACTUD_SIZE                        equ 0001h
ACTCON_ACTUD_LENGTH                      equ 0001h
ACTCON_ACTUD_MASK                        equ 0040h
ACTCON_ACTEN_POSN                        equ 0007h
ACTCON_ACTEN_POSITION                    equ 0007h
ACTCON_ACTEN_SIZE                        equ 0001h
ACTCON_ACTEN_LENGTH                      equ 0001h
ACTCON_ACTEN_MASK                        equ 0080h
ACTCON_STOR_POSN                         equ 0001h
ACTCON_STOR_POSITION                     equ 0001h
ACTCON_STOR_SIZE                         equ 0001h
ACTCON_STOR_LENGTH                       equ 0001h
ACTCON_STOR_MASK                         equ 0002h
ACTCON_STLOCK_POSN                       equ 0003h
ACTCON_STLOCK_POSITION                   equ 0003h
ACTCON_STLOCK_SIZE                       equ 0001h
ACTCON_STLOCK_LENGTH                     equ 0001h
ACTCON_STLOCK_MASK                       equ 0008h
ACTCON_STSRC_POSN                        equ 0004h
ACTCON_STSRC_POSITION                    equ 0004h
ACTCON_STSRC_SIZE                        equ 0001h
ACTCON_STSRC_LENGTH                      equ 0001h
ACTCON_STSRC_MASK                        equ 0010h
ACTCON_STUD_POSN                         equ 0006h
ACTCON_STUD_POSITION                     equ 0006h
ACTCON_STUD_SIZE                         equ 0001h
ACTCON_STUD_LENGTH                       equ 0001h
ACTCON_STUD_MASK                         equ 0040h
ACTCON_STEN_POSN                         equ 0007h
ACTCON_STEN_POSITION                     equ 0007h
ACTCON_STEN_SIZE                         equ 0001h
ACTCON_STEN_LENGTH                       equ 0001h
ACTCON_STEN_MASK                         equ 0080h
ACTCON_ACTOR_POSN                        equ 0001h
ACTCON_ACTOR_POSITION                    equ 0001h
ACTCON_ACTOR_SIZE                        equ 0001h
ACTCON_ACTOR_LENGTH                      equ 0001h
ACTCON_ACTOR_MASK                        equ 0002h
ACTCON_ACTD_POSN                         equ 0006h
ACTCON_ACTD_POSITION                     equ 0006h
ACTCON_ACTD_SIZE                         equ 0001h
ACTCON_ACTD_LENGTH                       equ 0001h
ACTCON_ACTD_MASK                         equ 0040h
ACTCON_ACTSEL_POSN                       equ 0007h
ACTCON_ACTSEL_POSITION                   equ 0007h
ACTCON_ACTSEL_SIZE                       equ 0001h
ACTCON_ACTSEL_LENGTH                     equ 0001h
ACTCON_ACTSEL_MASK                       equ 0080h

